["12 noon bank of england monetary policy summary, november 2017 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment.  At its meeting ending on 1 november 2017, the mpc voted by a majority of 7-2 to increase bank rate by 0.25 percentage points, to 0.5%.  The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion.  The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. The mpc's outlook for inflation and activity in the november inflation report is broadly similar to its projections in august.  In the mpc's central forecast, conditioned on the gently rising path of bank rate implied by current",
"12 noon bank of england monetary policy summary, december 2017 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment.  At its meeting ending on 13 december 2017, the mpc voted unanimously to maintain bank rate at 0.5%.  The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion.  The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. In the mpc's most recent economic projections, set out in the november inflation report, gdp grew modestly over the next few years, at a pace just above its reduced rate of potential.  Consumption growth remained sluggish in",
"12 noon bank of england monetary policy summary, february 2018 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment. At its meeting ending on 7 february 2018, the mpc voted unanimously to maintain bank rate at 0.5%. The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion. The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. The mpc's latest projections for output and inflation are set out in detail in the accompanying february inflation report. The global economy is growing at its fastest pace in seven years. The expansion is becoming increasingly",
"12 noon bank of england monetary policy summary, march 2018 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment. At its meeting ending on 21 march 2018, the mpc voted by a majority of 7-2 to maintain bank rate at 0.5%. The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion. The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. In the mpc's most recent projections, set out in the february inflation report, gdp was expected to grow by around 1 3/4% per year on average over the forecast period. While modest by historical standards, that growth rate was expected to",
"12 noon bank of england monetary policy summary, may 2018 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment. At its meeting ending on 9 may 2018, the mpc voted by a majority of 7-2 to maintain bank rate at 0.5%. The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion. The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. The mpc's updated projections for inflation and activity are set out in the may similar to those set out in the previous report.",
"12 noon bank of england monetary policy summary, june 2018 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment. At its meeting ending on 20 june 2018, the mpc voted by a majority of 6-3 to maintain bank rate at 0.5%. The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion. The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. In the mpc's most recent projections, set out in the may inflation report, gdp was expected to grow by around 1 3/4% per year on average over the forecast, conditioned on the gently rising path of bank rate implied by market yields at",
"12 noon bank of england monetary policy summary, august 2018 the bank of england's monetary policy committee (mpc) sets monetary policy to meet the 2% inflation target, and in a way that helps to sustain growth and employment. At its meeting ending on 1 august 2018, the mpc voted unanimously to increase bank rate by 0.25 percentage points, to 0.75%. The committee voted unanimously to maintain the stock of sterling non-financial investment-grade corporate bond purchases, financed by the issuance of central bank reserves, at stg 10 billion. The committee also voted unanimously to maintain the stock of uk government bond purchases, financed by the issuance of central bank reserves, at stg 435 billion. Since the may inflation report, the near-term outlook has evolved broadly in line with the mpc's expectations. Recent data appear to confirm that the dip in output in the first quarter was temporary, with momentum recovering in the"]